---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionData.ClearLoops
source: html/701db8ee-dd08-6b68-c340-b8311034f254.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.ClearLoops Method

Clears the curve loops stored in the extrusion data.

## Syntax (C#)
```csharp
public void ClearLoops()
```